<head>
    <title>Блог</title>
</head>

<style>
    h1, h2, h3, h4, p, a {
        color: white;
    }
    <?php
    $browser = $_SERVER['HTTP_USER_AGENT'];
    if (strpos($browser, 'MSIE') !== false) {
        echo '    h1, h2, h3, h4, p, a {
        color: black;
    }';
    }
    ?>
</style>

<center>
<h1>20 Сентября, 2024 Года, 4 поколение сайта</h1>
<p>Итак, не знаю если всё таки сегодня выйдет 4 поколение сайта или завтра но всё же напишу бложек</p>
<p>Я вообще планировал выпустить 4 поколение сайта 11 сентября (это не черный юмор)</p>
<p>Но скорее всего я выпущу 4 поколение либо сегодня, либо завтра (надеюсь что вообще не попаду в "бутлуп")</p>
<p>Да бложек не большой, но да :DDDD</p>
</center>